import random

WELCOME_NEW = [
    """🎭 سلام {name}!

به ربات رسمی اتاق فرار خوش اومدی 😈

از این به بعد رزرو سانس، پیگیری بازی‌ها و کلی امکانات دیگه رو همینجا داری.

فقط یه خواهش...
اگه گیر افتادی، تقصیر ما نیست! 😂""",

    """👀 سلام {name}!

به نظر میاد تصمیم گرفتی شانس خودتو امتحان کنی...

امیدوارم آخرش سالم از اتاق بیرون بیای! 😅""",

    """🔥 خوش اومدی {name}!

از اینجا به بعد همه چیز جدیه...
البته تا وقتی که از ترس جیغ نزنی! 😂""",

    """🕯️ سلام {name}!

درها بسته شدن...
حالا فقط باید ببینیم میتونی راه خروج رو پیدا کنی یا نه! 👻"""
]

WELCOME_BACK = [
    """😎 خوش برگشتی {name}!

آماده‌ای یه ماجراجویی دیگه شروع کنیم؟""",

    """👋 دوباره اومدی {name}!

امیدوارم این دفعه رکورد فرار رو بزنی 😁""",

    """🎭 خوش برگشتی!

همه برمیگردن...
ولی معلوم نیست همه سالم برگردن! 😈""",

    """🔥 سلام دوباره {name}!

ربات منتظر بود دوباره ببینتت 😁"""
]


def new_user(name):
    return random.choice(WELCOME_NEW).format(name=name)


def old_user(name):
    return random.choice(WELCOME_BACK).format(name=name)